feat: improve issuance config (#13)
* feat: improve issuance config

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

* chore: fix test and doc

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

* fix: testing

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

* chore: fix linting

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

* fix: add public url

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

* fix: remove docker image build in testing phase

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>

---------

Signed-off-by: Mirko Mollik <mirko.mollik@eudi.sprind.org>
